In [1]:
import pandas as pd
import numpy as np
ser1 = pd.Series(np.arange(4)*10)
ser1

0     0
1    10
2    20
3    30
dtype: int32

In [2]:
ser1[1:3]

1    10
2    20
dtype: int32

In [5]:
index=['a','b','c','d']
ser2 = pd.Series(np.arange(4)*10,index)
ser2

a     0
b    10
c    20
d    30
dtype: int32

In [6]:
ser2['b':'d']

b    10
c    20
d    30
dtype: int32

In [7]:
data = np.arange(16).reshape((4,4))
index = ['Ohio', 'Colorado', 'Utah', 'New York']
columns = ['one', 'two', 'three', 'four']
df1 = pd.DataFrame(data, index, columns)
df1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
df1.four # 데이터 프레임 추출

Ohio         3
Colorado     7
Utah        11
New York    15
Name: four, dtype: int32

In [9]:
df1['two'] # 데이터 프레임 추출

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [11]:
df1[['two','four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [12]:
df1[df1['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
df1.loc['Colorado':'Utah',['two','three']]

          two  three
Colorado    5      6
Utah        9     10

In [17]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5],
              index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
              index=['a', 'c', 'e', 'f', 'g'])

In [19]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)),
                  columns = ["a", "b", "c", "d"])
df2 = pd.DataFrame(np.arange(20).reshape((4,5)),
                  columns = ["a", "b", "c", "d", "e"])
print(df1);print(df2)

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [20]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [21]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [26]:
frame = pd.DataFrame(np.random.randn(4, 3),
                    columns = ["b", "d","e"],
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.258568 -0.849838  1.228956
Ohio    0.845841  1.076789  0.448428
Texas  -1.697515 -0.275432  0.910559
Oregon -0.735341  0.948922  0.155208

In [27]:
# lambda 함수 이용하기
frame.apply(lambda x: x.max()-x.min(),
           axis='columns')

Utah      2.078794
Ohio      0.628361
Texas     2.608074
Oregon    1.684262
dtype: float64

In [28]:
format = lambda x: '%.2f' % x # frame 객체에서 실숫값을 문자열 포멧으로 변환 -> applymap
frame.applymap(format)

            b      d     e
Utah    -0.26  -0.85  1.23
Ohio     0.85   1.08  0.45
Texas   -1.70  -0.28  0.91
Oregon  -0.74   0.95  0.16

In [30]:
s3 = pd.Series([0, 1, 2, 3],
               index=['d','a','b','c'])
s3.sort_index() # 인덱스 정렬하여 데이터 출력

a    1
b    2
c    3
d    0
dtype: int64

In [37]:
df3 = pd.DataFrame(np.arange(8).reshape((2,4)),
                  index = ['three', 'one'],
                  columns=['d','a','b','c'])
df3.sort_index(axis=1).sort_index() # 정렬 한번에 처리하기

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [38]:
s4 = pd.Series([4, 7, -3, 2])
s4.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [39]:
s5 = pd.Series([7, -5, 7, 4, 2, 0, 4])
s5.rank() # 동률인 경우 그룹내 높은 순위 적용 s5.rank(ascending=False, method='max')

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [43]:
s6 = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
s6 #**.index.is_unique -> 인덱스의 중복 여부확인(중복값이 없으면 스칼라값을 반환한다고 함)

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [45]:
s6['a']

a    0
a    1
dtype: int64